---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.MassSurfaceDataSource.EnergyData
enum: Autodesk.Revit.DB.Analysis.MassSurfaceDataSource
source: html/64d3b063-b6d0-3e99-734d-8bc2f60af016.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceDataSource.EnergyData

Synchronize with the EnergyDataSettings.